wimalopaan/wmucpp/include_stm32/pwm.h
                using component_t = Mcu::Components::Timer<TimerNumber>;

                static inline constexpr uint16_t onems = 1640;
                static inline constexpr uint16_t mid = onems + onems / 2;
                static inline constexpr uint16_t period = onems * 20;
                static inline constexpr uint16_t prescaler = (Clock::config::frequency.value / period) / 50;

#ifdef STM32G4
                static inline void init() {
                    if constexpr (TimerNumber == 1) {
                        RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
                    }
                    else if constexpr (TimerNumber == 2) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM2EN;
                    }
                    else if constexpr (TimerNumber == 3) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM3EN;
                    }
                    else if constexpr (TimerNumber == 4) {
                        RCC->APB1ENR1 |= RCC_APB1ENR1_TIM4EN;
                    }
                    else {
                        static_assert(false);
                    }
                    mcuTimer->PSC = prescaler;
                    mcuTimer->ARR = period;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC1M_Pos); // pwm1
                    mcuTimer->CCMR1 |= TIM_CCMR1_OC1PE;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC2M_Pos); // pwm2
                    mcuTimer->CCMR1 |= TIM_CCMR1_OC2PE;
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC3M_Pos); // pwm3
                    mcuTimer->CCMR2 |= TIM_CCMR1_OC1PE;
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC4M_Pos); // pwm4
                    mcuTimer->CCMR2 |= TIM_CCMR1_OC2PE;
                    mcuTimer->CCER |= TIM_CCER_CC1E;
                    mcuTimer->CCER |= TIM_CCER_CC2E;
                    mcuTimer->CCER |= TIM_CCER_CC3E;
                    mcuTimer->CCER |= TIM_CCER_CC4E;
                    mcuTimer->CCR1 = mid;
                    mcuTimer->CCR2 = mid;
                    mcuTimer->CCR3 = mid;
                    mcuTimer->CCR4 = mid;
                    mcuTimer->EGR |= TIM_EGR_UG;
                    mcuTimer->CR1 |= TIM_CR1_ARPE;
                    mcuTimer->CR1 |= TIM_CR1_CEN;
                }
#endif
                static inline void reset() {
                    IO::outl<debug>("# PWM reset ", TimerNumber);
                    const auto rcc = Mcu::Stm::Address<Mcu::Components::Rcc>::value;
                    if constexpr (TimerNumber == 1) {
#ifdef STM32G0xx
                        rcc->APBRSTR2 = RCC_APBRSTR2_TIM1RST;
                        rcc->APBRSTR2 &= ~RCC_APBRSTR2_TIM1RST;
#endif
#ifdef STM32G4
                        RCC->APB2RSTR = RCC_APB2RSTR_TIM1RST;
                        RCC->APB2RSTR &= RCC_APB2RSTR_TIM1RST;
#endif
                    }
#ifdef STM32G0B1xx
                    else if constexpr (TimerNumber == 2) {
                        rcc->APBRSTR1 = RCC_APBRSTR1_TIM2RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_TIM2RST;
                    }
#endif
                    else if constexpr (TimerNumber == 3) {
#ifdef STM32G0xx
                        rcc->APBRSTR1 = RCC_APBRSTR1_TIM3RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_TIM3RST;
#endif
#ifdef STM32G4
                        RCC->APB1RSTR1 = RCC_APB1RSTR1_TIM3RST;
                        RCC->APB1RSTR1 &= RCC_APB1RSTR1_TIM3RST;
#endif
                    }
#ifdef STM32G0B1xx
                    else if constexpr (TimerNumber == 4) {
                        rcc->APBRSTR1 = RCC_APBRSTR1_TIM4RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_TIM4RST;
                    }
                    else if constexpr (TimerNumber == 14) {
                        rcc->APBRSTR2 = RCC_APBRSTR2_TIM14RST;
                        rcc->APBRSTR2 &= ~RCC_APBRSTR2_TIM14RST;
                    }
#endif
                    else if constexpr (TimerNumber == 17) {
#ifdef STM32G0xx
                        rcc->APBRSTR2 = RCC_APBRSTR2_TIM17RST;
                        rcc->APBRSTR2 &= ~RCC_APBRSTR2_TIM17RST;
#endif
#ifdef STM32G4
                        rcc->APB2RSTR = RCC_APB2RSTR_TIM17RST;
                        rcc->APB2RSTR &= ~RCC_APB2RSTR_TIM17RST;
#endif
                    }
                    else {
                        static_assert(false);
                    }
                }
#ifdef STM32G0
                static inline void init() {
                    IO::outl<debug>("# PWM init ", TimerNumber);
                    if constexpr (TimerNumber == 1) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM1EN;
                    }
#ifdef STM32G0B1xx
                    else if constexpr (TimerNumber == 2) {
                        RCC->APBENR1 |= RCC_APBENR1_TIM2EN;
                    }
#endif
                    else if constexpr (TimerNumber == 3) {
                        RCC->APBENR1 |= RCC_APBENR1_TIM3EN;
                    }
#ifdef STM32G0B1xx
                    else if constexpr (TimerNumber == 4) {
                        RCC->APBENR1 |= RCC_APBENR1_TIM4EN;
                    }
                    else if constexpr (TimerNumber == 14) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM14EN;
                    }
                    else if constexpr (TimerNumber == 17) {
                        RCC->APBENR2 |= RCC_APBENR2_TIM17EN;
                    }
#endif
                    else {
                        static_assert(false);
                    }
                    mcuTimer->PSC = prescaler;
                    mcuTimer->ARR = period;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC1M_Pos); // pwm1
                    mcuTimer->CCMR1 |= TIM_CCMR1_OC1PE;
                    mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC2M_Pos); // pwm2
                    mcuTimer->CCMR1 |= TIM_CCMR1_OC2PE;
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC3M_Pos); // pwm3
                    mcuTimer->CCMR2 |= TIM_CCMR2_OC3PE;
                    mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC4M_Pos); // pwm4
                    mcuTimer->CCMR2 |= TIM_CCMR2_OC4PE;
                    mcuTimer->CCER |= TIM_CCER_CC1E;
                    mcuTimer->CCER |= TIM_CCER_CC2E;
                    mcuTimer->CCER |= TIM_CCER_CC3E;
                    mcuTimer->CCER |= TIM_CCER_CC4E;
                    mcuTimer->CCR1 = mid;
                    mcuTimer->CCR2 = mid;
                    mcuTimer->CCR3 = mid;
                    mcuTimer->CCR4 = mid;
                    if constexpr ((TimerNumber == 1) || (TimerNumber == 17)) {
                        mcuTimer->BDTR |= TIM_BDTR_MOE;
                    }
                    mcuTimer->EGR |= TIM_EGR_UG;
                    mcuTimer->CR1 |= TIM_CR1_ARPE;
                    mcuTimer->CR1 |= TIM_CR1_CEN;
                }
#endif

                static inline constexpr uint16_t sbusMid = 992;

                static inline void set(const uint8_t channel, uint16_t sbus) {
                    const uint16_t t = sbus - 172 + onems;
                    switch (channel) {
                    case 0:
                        mcuTimer->CCR1 = t;
                        break;
                    case 1:
                        mcuTimer->CCR2 = t;
                        break;
                    case 2:
                        mcuTimer->CCR3 = t;
                        break;
                    case 3:
                        mcuTimer->CCR4 = t;
                        break;
                    default:
                        break;
                    }
                }
            };
        }
    }
}
